src/Software Engineering/Doxygen/Doxygen .org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Doxygen Notes
#+OPTIONS: num:nil H:2


* Doxygen Download Page
http://www.stack.nl/~dimitri/doxygen/download.html

* Compiling from source on UNIX
** Unpack the archive, unless you already have done that:
#+begin_src sh
gunzip doxygen-$VERSION.src.tar.gz    # uncompress the archive
tar xf doxygen-$VERSION.src.tar       # unpack it
#+end_src
** Run the configure script:
#+begin_src sh
sh ./configure
#+end_src
The script tries to determine the platform you use, the make tool
(which must be GNU make) and the perl interpreter. It will report what
it finds.

To override the auto detected platform and compiler you can run
configure as follows:
#+begin_src sh
configure --platform platform-type
#+end_src
See the PLATFORMS file for a list of possible platform options.

If you have Qt-4.3 or higher installed and want to build the GUI
front-end, you should run the configure script with the
–with-doxywizard option:
#+begin_src sh
configure --with-doxywizard
#+end_src
For an overview of other configuration options use
#+begin_src sh
configure --help
#+end_src
** Compile the program by running make:
#+begin_src sh
make
#+end_src
The program should compile without problems and the binaries (doxygen
and optionally doxywizard) should be available in the bin directory of
the distribution.

** Optional: Generate the user manual.
#+begin_src sh
make docs
#+end_src
To let doxygen generate the HTML documentation.

The HTML directory of the distribution will now contain the html
documentation (just point a HTML browser to the file index.html in the
html directory). You will need the python interpreter for this.

** Optional: Generate a PDF version of the manual (you will need pdflatex, makeindex, and egrep for this).
#+begin_src sh
make pdf
#+end_src
The PDF manual doxygen_manual.pdf will be located in the latex
directory of the distribution. Just view and print it via the acrobat
reader.



** install
make install

* Tools used to develop doxygen
Doxygen was developed and tested under Linux & MacOSX using the following open-source tools:

+ GCC version 3.3.6 (Linux) and 4.0.1 (MacOSX)
+ GNU flex version 2.5.33 (Linux) and 2.5.4 (MacOSX)
+ GNU bison version 1.75
+ GNU make version 3.80
+ Perl version 5.8.1
+ VIM version 6.2
+ Firefox 1.5
+ Trolltech's tmake version 1.3 (included in the distribution)
+ teTeX version 2.0.2
+ CVS 1.12.12

* LaTex and Ghostscript
LaTex:

+ MikTex: http://www.miktex.org/
+ XemTex: http://www.xemtex.org/

Ghostscript:

http://sourceforge.net/projects/ghostscript/

* Getting started 
** Step 1: Creating a configuration file
doxygen -g <config-file>

If you use - (i.e. the minus sign) as the file name then doxygen will try to read the configuration file from standard input (stdin), which can be useful for scripting.

** Step 2: Running doxygen
To generate the documentation you can now enter: 

doxygen <config-file>

** Step 3: Documenting the sources
1. Place a special documentation block in front of the declaration or
   definition of the member, class or namespace. For file, class and
   namespace members it is also allowed to place the documentation
   directly after the member.

   See section Special comment blocks to learn more about special
   documentation blocks.

2. Place a special documentation block somewhere else (another file or
   another location) and put a structural command in the documentation
   block. A structural command links a documentation block to a
   certain entity that can be documented (e.g. a member, class,
   namespace or file).

   See section Documentation at other places to learn more about
   structural commands.


During parsing the following steps take place:

+ Markdown formatting is replaced by corresponding HTML or special commands.
+ The special commands inside the documentation are executed. See
  section Special Commands for an overview of all commands.
+ If a line starts with some whitespace followed by one or more
  asterisks (*) and then optionally more whitespace, then all
  whitespace and asterisks are removed.
+ All resulting blank lines are treated as a paragraph separators.
  This saves you from placing new-paragraph commands yourself in order
  to make the generated documentation readable.
+ Links are created for words corresponding to documented classes
  (unless the word is preceded by a %; then the word will not be
  linked and the % sign is removed).
+ Links to members are created when certain patterns are found in the
  text. See section Automatic link generation for more information on
  how the automatic link generation works.
+ HTML tags that are in the documentation are interpreted and
  converted to  equivalents for the  output. See section HTML Commands
  for an overview of all supported HTML tags.


* Documenting the code 
** Comment blocks for C-like languages (C/C++/C#/Objective-C/PHP/Java)
*** There are several ways to mark a comment block as a detailed description: 

**** 1.You can use the JavaDoc style, which consist of a C-style comment block starting with two *'s, like this:
#+begin_src sh
/**
 * ... text ...
 */
#+end_src
