public_html/Software Engineering/Doxygen/Doxygen .html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Doxygen Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Doxygen Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-08 12:28:12 China Standard Time"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Doxygen Notes</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Doxygen Download Page</a></li>
<li><a href="#sec-2">Compiling from source on UNIX</a>
<ul>
<li><a href="#sec-2-1">Unpack the archive, unless you already have done that:</a></li>
<li><a href="#sec-2-2">Run the configure script:</a></li>
<li><a href="#sec-2-3">Compile the program by running make:</a></li>
<li><a href="#sec-2-4">Optional: Generate the user manual.</a></li>
<li><a href="#sec-2-5">Optional: Generate a PDF version of the manual (you will need pdflatex, makeindex, and egrep for this).</a></li>
<li><a href="#sec-2-6">install</a></li>
</ul>
</li>
<li><a href="#sec-3">Tools used to develop doxygen</a></li>
<li><a href="#sec-4">LaTex and Ghostscript</a></li>
<li><a href="#sec-5">Getting started</a>
<ul>
<li><a href="#sec-5-1">Step 1: Creating a configuration file</a></li>
<li><a href="#sec-5-2">Step 2: Running doxygen</a></li>
<li><a href="#sec-5-3">Step 3: Documenting the sources</a></li>
</ul>
</li>
<li><a href="#sec-6">Documenting the code</a>
<ul>
<li><a href="#sec-6-1">Comment blocks for C-like languages (C/C++/C#/Objective-C/PHP/Java)</a></li>
<li><a href="#sec-6-2">Documentation at other places</a></li>
<li><a href="#sec-6-3">Comment blocks in Python</a></li>
<li><a href="#sec-6-4">Anatomy of a comment block</a></li>
</ul>
</li>
<li><a href="#sec-7"></a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Doxygen Download Page</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://www.stack.nl/~dimitri/doxygen/download.html">http://www.stack.nl/~dimitri/doxygen/download.html</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Compiling from source on UNIX</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Unpack the archive, unless you already have done that:</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example">gunzip doxygen-$VERSION.src.tar.gz    # uncompress the archive
tar xf doxygen-$VERSION.src.tar       # unpack it
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Run the configure script:</h3>
<div class="outline-text-3" id="text-2-2">




<pre class="example">sh ./configure
</pre>

<p>
The script tries to determine the platform you use, the make tool
(which must be GNU make) and the perl interpreter. It will report what
it finds.
</p>
<p>
To override the auto detected platform and compiler you can run
configure as follows:
</p>


<pre class="example">configure --platform platform-type
</pre>

<p>
See the PLATFORMS file for a list of possible platform options.
</p>
<p>
If you have Qt-4.3 or higher installed and want to build the GUI
front-end, you should run the configure script with the
–with-doxywizard option:
</p>


<pre class="example">configure --with-doxywizard
</pre>

<p>
For an overview of other configuration options use
</p>


<pre class="example">configure --help
</pre>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Compile the program by running make:</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="example">make
</pre>

<p>
The program should compile without problems and the binaries (doxygen
and optionally doxywizard) should be available in the bin directory of
the distribution.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Optional: Generate the user manual.</h3>
<div class="outline-text-3" id="text-2-4">




<pre class="example">make docs
</pre>

<p>
To let doxygen generate the HTML documentation.
</p>
<p>
The HTML directory of the distribution will now contain the html
documentation (just point a HTML browser to the file index.html in the
html directory). You will need the python interpreter for this.
</p>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Optional: Generate a PDF version of the manual (you will need pdflatex, makeindex, and egrep for this).</h3>
<div class="outline-text-3" id="text-2-5">




<pre class="example">make pdf
</pre>

<p>
The PDF manual doxygen<sub>manual</sub>.pdf will be located in the latex
directory of the distribution. Just view and print it via the acrobat
reader.
</p>


</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6">install</h3>
<div class="outline-text-3" id="text-2-6">

<p>make install
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Tools used to develop doxygen</h2>
<div class="outline-text-2" id="text-3">

<p>Doxygen was developed and tested under Linux &amp; MacOSX using the following open-source tools:
</p>
<ul>
<li>GCC version 3.3.6 (Linux) and 4.0.1 (MacOSX)
</li>
<li>GNU flex version 2.5.33 (Linux) and 2.5.4 (MacOSX)
</li>
<li>GNU bison version 1.75
</li>
<li>GNU make version 3.80
</li>
<li>Perl version 5.8.1
</li>
<li>VIM version 6.2
</li>
<li>Firefox 1.5
</li>
<li>Trolltech's tmake version 1.3 (included in the distribution)
</li>
<li>teTeX version 2.0.2
</li>
<li>CVS 1.12.12
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">LaTex and Ghostscript</h2>
<div class="outline-text-2" id="text-4">

<p>LaTex:
</p>
<ul>
<li>MikTex: <a href="http://www.miktex.org/">http://www.miktex.org/</a>
</li>
<li>XemTex: <a href="http://www.xemtex.org/">http://www.xemtex.org/</a>
</li>
</ul>


<p>
Ghostscript:
</p>
<p>
<a href="http://sourceforge.net/projects/ghostscript/">http://sourceforge.net/projects/ghostscript/</a>
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Getting started</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Step 1: Creating a configuration file</h3>
<div class="outline-text-3" id="text-5-1">

<p>doxygen -g &lt;config-file&gt;
</p>
<p>
If you use - (i.e. the minus sign) as the file name then doxygen will try to read the configuration file from standard input (stdin), which can be useful for scripting.
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Step 2: Running doxygen</h3>
<div class="outline-text-3" id="text-5-2">

<p>To generate the documentation you can now enter: 
</p>
<p>
doxygen &lt;config-file&gt;
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Step 3: Documenting the sources</h3>
<div class="outline-text-3" id="text-5-3">

<ol>
<li>Place a special documentation block in front of the declaration or
   definition of the member, class or namespace. For file, class and
   namespace members it is also allowed to place the documentation
   directly after the member.

<p>
   See section Special comment blocks to learn more about special
   documentation blocks.
</p>
</li>
<li>Place a special documentation block somewhere else (another file or
   another location) and put a structural command in the documentation
   block. A structural command links a documentation block to a
   certain entity that can be documented (e.g. a member, class,
   namespace or file).

<p>
   See section Documentation at other places to learn more about
   structural commands.
</p></li>
</ol>



<p>
During parsing the following steps take place:
</p>
<ul>
<li>Markdown formatting is replaced by corresponding HTML or special commands.
</li>
<li>The special commands inside the documentation are executed. See
  section Special Commands for an overview of all commands.
</li>
<li>If a line starts with some whitespace followed by one or more
  asterisks (*) and then optionally more whitespace, then all
  whitespace and asterisks are removed.
</li>
<li>All resulting blank lines are treated as a paragraph separators.
  This saves you from placing new-paragraph commands yourself in order
  to make the generated documentation readable.
</li>
<li>Links are created for words corresponding to documented classes
  (unless the word is preceded by a %; then the word will not be
  linked and the % sign is removed).
</li>
<li>Links to members are created when certain patterns are found in the
  text. See section Automatic link generation for more information on
  how the automatic link generation works.
</li>
<li>HTML tags that are in the documentation are interpreted and
  converted to  equivalents for the  output. See section HTML Commands
  for an overview of all supported HTML tags.
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Documenting the code</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Comment blocks for C-like languages (C/C++/C#/Objective-C/PHP/Java)</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li id="sec-6-1-1">There are several ways to mark a comment block as a detailed description:<br/>

<ul>
<li id="sec-6-1-1-1">1.You can use the JavaDoc style, which consist of a C-style comment block starting with two *'s, like this:<br/>



<pre class="example">/**
 * ... text ...
 */
</pre>

</li>
</ul>
<ul>
