src/Software Engineering/Doxygen/Doxygen .org
**** 2.or you can use the Qt style and add an exclamation mark (!) after the opening of a C-style comment block, as shown in this example:
#+begin_src sh
/*!
 * ... text ...
 */
#+end_src
In both cases the intermediate *'s are optional, so
#+begin_src sh
/*!
 ... text ...
*/
#+end_src
is also valid.


**** 3.A third alternative is to use a block of at least two C++ comment lines, where each line starts with an additional slash or an exclamation mark. Here are examples of the two cases:
#+begin_src sh
///
/// ... text ...
///
#+end_src
or
#+begin_src sh
//!
//!... text ...
//!
#+end_src
Note that a blank line ends a documentation block in this case.


**** 4. Some people like to make their comment blocks more visible 
in the documentation. For this purpose you can use the following:
#+begin_src sh
/********************************************//**
 *  ... text
 ***********************************************/
(note the 2 slashes to end the normal comment block and start a special comment block).
#+end_src
or
#+begin_src sh
/////////////////////////////////////////////////
/// ... text ...
/////////////////////////////////////////////////
#+end_src

*** For the brief description there are also several possibilities: 
**** 1.One could use the \brief 
command with one of the above comment blocks. This command ends at the
end of a paragraph, so the detailed description follows after an empty
line.

Here is an example:
#+begin_src sh
/*! \brief Brief description.
 *         Brief description continued.
 *
 *  Detailed description starts here.
 */
#+end_src
**** 2.If JAVADOC_AUTOBRIEF is set to YES 
in the configuration file, then using JavaDoc style comment blocks
will automatically start a brief description which ends at the first
dot followed by a space or new line. Here is an example:

#+begin_src sh
/** Brief description which ends at this dot. Details follow
 *  here.
 */
#+end_src
The option has the same effect for multi-line special C++ comments: 
#+begin_src sh
/// Brief description which ends at this dot. Details follow
/// here.
#+end_src
**** 3.A third option is to use a special C++ style comment 
which does not span more than one line. Here are two examples: 
#+begin_src sh
/// Brief description.
/** Detailed description. */
#+end_src
or
#+begin_src sh
//! Brief description.

//! Detailed description 
//! starts here.
#+end_src
Note the blank line in the last example, which is required to separate
the brief description from the block containing the detailed
description. The JAVADOC_AUTOBRIEF should also be set to NO for this
case.


As you can see doxygen is quite flexible. If you have multiple detailed descriptions, like in the following example:
#+begin_src sh
//! Brief description, which is
//! really a detailed description since it spans multiple lines.
/*! Another detailed description!
 */
#+end_src

*** Putting documentation after members
    If you want to document the members of a file, struct, union, class,
or enum, it is sometimes desired to place the documentation block
after the member instead of before. For this purpose you have to put
an additional < marker in the comment block. Note that this also works
for the parameters of a function.

Here are some examples: 
#+begin_src sh
int var; /*!< Detailed description after the member */
#+end_src
This block can be used to put a Qt style detailed documentation block after a member. Other ways to do the same are: 
#+begin_src sh
int var; /**< Detailed description after the member */
#+end_src
or 
#+begin_src sh
int var; //!< Detailed description after the member
         //!< 
#+end_src
or 
#+begin_src sh
int var; ///< Detailed description after the member
         ///< 
#+end_src
Most often one only wants to put a brief description after a member.
This is done as follows: 
#+begin_src sh
int var; //!< Brief description after the member
#+end_src
or 
#+begin_src sh
int var; ///< Brief description after the member
#+end_src
For functions one can use the @param command to document the parameters and then use [in], [out], [in,out] to document the direction. For inline documentation this is also possible by starting with the direction attribute, e.g. 
#+begin_src sh
void foo(int v /**< [in] docs for input parameter v. */);
#+end_src
*** Examples
**** Here is an example of a documented piece of C++ code using the Qt style: 
#+begin_src c
  
  //!  A test class. 
  /*!  
  A more elaborate class description.
  ,*/
  class Test
  {  
   public:
    //! An enum.
    /*! More detailed enum description. */
    enum TEnum {
      TVal1, /*!< Enum value TVal1. */
      TVal2, /*!< Enum value TVal2. */
      TVal3  /*!< Enum value TVal3. */
    }
    //! Enum pointer.
    /*! Details. */
    *enumPtr,
      //! Enum variable.
      /*! Details. */
      enumVar;
  
    //! A constructor.
    /*!      A more elaborate description of the constructor.    */
    Test();
    //! A destructor.
    /*!
      A more elaborate description of the destructor.
    */
    ~Test();
  
    //! A normal member taking two arguments and returning an integer value.
    /*!
      \param a an integer argument.
      \param s a constant character pointer.
      \return The test results
      \sa Test(), ~Test(), testMeToo() and publicVar()
    */
    int testMe(int a,const char *s);
    //! A pure virtual member.
    /*!
      \sa testMe()
      \param c1 the first argument.
      \param c2 the second argument.
    */
    virtual void testMeToo(char c1,char c2) = 0;
    //! A public variable.
    /*!
      Details.
    */
    int publicVar;
    //! A function variable.
    /*!
      Details.
    */
    int (*handler)(int a,int b);
  };
#+end_src
**** using JAVADOC style
This is not according the JavaDoc specification however, where the
first sentence of the documentation block is automatically treated as
a brief description. To enable this behavior you should set
JAVADOC_AUTOBRIEF to YES in the configuration file. If you enable this
option and want to put a dot in the middle of a sentence without
ending it, you should put a backslash and a space after it. Here is an
example: 

#+begin_src c
  /** Brief description (e.g.\ using only a few words). Details follow. */
#+end_src

#+begin_src c
  /**
   *  A test class. A more elaborate class description.
   */
  class Test
  {
   public:
    /**
     * An enum.
     * More detailed enum description.
     */
    enum TEnum {
      TVal1, /**< enum value TVal1. */
      TVal2, /**< enum value TVal2. */
      TVal3  /**< enum value TVal3. */
    }
    *enumPtr, /**< enum pointer. Details. */
      enumVar;  /**< enum variable. Details. */
    
    /**
     * A constructor.
     * A more elaborate description of the constructor.
     */
    Test();
    /**
     * A destructor.
     * A more elaborate description of the destructor.
     */
    ~Test();
  
    /**
     *a normal member taking two arguments and returning an integer value.
     * @param a an integer argument.
     * @param s a constant character pointer.
     * @see Test()
     * @see ~Test()
     * @see testMeToo()
     * @see publicVar()
     * @return The test results
     */
    int testMe(int a,const char *s);
    /**
     * A pure virtual member.
     * @see testMe()
     * @param c1 the first argument.
     * @param c2 the second argument.
     */
    virtual void testMeToo(char c1,char c2) = 0;
    /**
     * a public variable.
     * Details.
     */
    int publicVar;
    /**
     * a function variable.
     * Details.
     */
    int (*handler)(int a,int b);};
#+end_src

** Documentation at other places
