public_html/Software Engineering/Doxygen/Doxygen .html
<li id="sec-6-1-1-2">2.or you can use the Qt style and add an exclamation mark (!) after the opening of a C-style comment block, as shown in this example:<br/>



<pre class="example">/*!
 * ... text ...
 */
</pre>

<p>
In both cases the intermediate *'s are optional, so
</p>


<pre class="example">/*!
 ... text ...
*/
</pre>

<p>
is also valid.
</p>

</li>
</ul>
<ul>
<li id="sec-6-1-1-3">3.A third alternative is to use a block of at least two C++ comment lines, where each line starts with an additional slash or an exclamation mark. Here are examples of the two cases:<br/>



<pre class="example">///
/// ... text ...
///
</pre>

<p>
or
</p>


<pre class="example">//!
//!... text ...
//!
</pre>

<p>
Note that a blank line ends a documentation block in this case.
</p>

</li>
</ul>
<ul>
<li id="sec-6-1-1-4">4. Some people like to make their comment blocks more visible<br/>
in the documentation. For this purpose you can use the following:



<pre class="example">/********************************************//**
 *  ... text
 ***********************************************/
(note the 2 slashes to end the normal comment block and start a special comment block).
</pre>

<p>
or
</p>


<pre class="example">/////////////////////////////////////////////////
/// ... text ...
/////////////////////////////////////////////////
</pre>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-2">For the brief description there are also several possibilities:<br/>
<ul>
<li id="sec-6-1-2-1">1.One could use the \brief<br/>
command with one of the above comment blocks. This command ends at the
end of a paragraph, so the detailed description follows after an empty
line.

<p>
Here is an example:
</p>


<pre class="example">/*! \brief Brief description.
 *         Brief description continued.
 *
 *  Detailed description starts here.
 */
</pre>

</li>
</ul>
<ul>
<li id="sec-6-1-2-2">2.If JAVADOC<sub>AUTOBRIEF</sub> is set to YES<br/>
in the configuration file, then using JavaDoc style comment blocks
will automatically start a brief description which ends at the first
dot followed by a space or new line. Here is an example:




<pre class="example">/** Brief description which ends at this dot. Details follow
 *  here.
 */
</pre>

<p>
The option has the same effect for multi-line special C++ comments: 
</p>


<pre class="example">/// Brief description which ends at this dot. Details follow
/// here.
</pre>

</li>
</ul>
<ul>
<li id="sec-6-1-2-3">3.A third option is to use a special C++ style comment<br/>
which does not span more than one line. Here are two examples: 



<pre class="example">/// Brief description.
/** Detailed description. */
</pre>

<p>
or
</p>


<pre class="example">//! Brief description.

//! Detailed description 
//! starts here.
</pre>

<p>
Note the blank line in the last example, which is required to separate
the brief description from the block containing the detailed
description. The JAVADOC<sub>AUTOBRIEF</sub> should also be set to NO for this
case.
</p>

<p>
As you can see doxygen is quite flexible. If you have multiple detailed descriptions, like in the following example:
</p>


<pre class="example">//! Brief description, which is
//! really a detailed description since it spans multiple lines.
/*! Another detailed description!
 */
</pre>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-3">Putting documentation after members<br/>
    If you want to document the members of a file, struct, union, class,
or enum, it is sometimes desired to place the documentation block
after the member instead of before. For this purpose you have to put
an additional &lt; marker in the comment block. Note that this also works
for the parameters of a function.

<p>
Here are some examples: 
</p>


<pre class="example">int var; /*!&lt; Detailed description after the member */
</pre>

<p>
This block can be used to put a Qt style detailed documentation block after a member. Other ways to do the same are: 
</p>


<pre class="example">int var; /**&lt; Detailed description after the member */
</pre>

<p>
or 
</p>


<pre class="example">int var; //!&lt; Detailed description after the member
         //!&lt; 
</pre>

<p>
or 
</p>


<pre class="example">int var; ///&lt; Detailed description after the member
         ///&lt; 
</pre>

<p>
Most often one only wants to put a brief description after a member.
This is done as follows: 
</p>


<pre class="example">int var; //!&lt; Brief description after the member
</pre>

<p>
or 
</p>


<pre class="example">int var; ///&lt; Brief description after the member
</pre>

<p>
For functions one can use the @param command to document the parameters and then use [in], [out], [in,out] to document the direction. For inline documentation this is also possible by starting with the direction attribute, e.g. 
</p>


<pre class="example">void foo(int v /**&lt; [in] docs for input parameter v. */);
</pre>

</li>
</ul>
<ul>
<li id="sec-6-1-4">Examples<br/>
<ul>
<li id="sec-6-1-4-1">Here is an example of a documented piece of C++ code using the Qt style:<br/>



<pre class="example">
//!  A test class. 
/*!  
A more elaborate class description.
*/
class Test
{  
 public:
  //! An enum.
  /*! More detailed enum description. */
  enum TEnum {
    TVal1, /*!&lt; Enum value TVal1. */
    TVal2, /*!&lt; Enum value TVal2. */
    TVal3  /*!&lt; Enum value TVal3. */
  }
  //! Enum pointer.
  /*! Details. */
  *enumPtr,
    //! Enum variable.
    /*! Details. */
    enumVar;

  //! A constructor.
  /*!      A more elaborate description of the constructor.    */
  Test();
  //! A destructor.
  /*!
    A more elaborate description of the destructor.
  */
  ~Test();

  //! A normal member taking two arguments and returning an integer value.
  /*!
    \param a an integer argument.
    \param s a constant character pointer.
    \return The test results
    \sa Test(), ~Test(), testMeToo() and publicVar()
  */
  int testMe(int a,const char *s);
  //! A pure virtual member.
  /*!
    \sa testMe()
    \param c1 the first argument.
    \param c2 the second argument.
  */
  virtual void testMeToo(char c1,char c2) = 0;
  //! A public variable.
  /*!
    Details.
  */
  int publicVar;
  //! A function variable.
  /*!
    Details.
  */
  int (*handler)(int a,int b);
};
</pre>

</li>
</ul>
<ul>
<li id="sec-6-1-4-2">using JAVADOC style<br/>
This is not according the JavaDoc specification however, where the
first sentence of the documentation block is automatically treated as
a brief description. To enable this behavior you should set
JAVADOC<sub>AUTOBRIEF</sub> to YES in the configuration file. If you enable this
option and want to put a dot in the middle of a sentence without
ending it, you should put a backslash and a space after it. Here is an
example: 




<pre class="example">/** Brief description (e.g.\ using only a few words). Details follow. */
</pre>



<pre class="example">/**
 *  A test class. A more elaborate class description.
 */
class Test
{
 public:
  /**
   * An enum.
   * More detailed enum description.
   */
  enum TEnum {
    TVal1, /**&lt; enum value TVal1. */
    TVal2, /**&lt; enum value TVal2. */
    TVal3  /**&lt; enum value TVal3. */
  }
  *enumPtr, /**&lt; enum pointer. Details. */
    enumVar;  /**&lt; enum variable. Details. */

  /**
   * A constructor.
   * A more elaborate description of the constructor.
   */
  Test();
  /**
   * A destructor.
   * A more elaborate description of the destructor.
   */
  ~Test();

  /**
   *a normal member taking two arguments and returning an integer value.
   * @param a an integer argument.
   * @param s a constant character pointer.
   * @see Test()
   * @see ~Test()
   * @see testMeToo()
   * @see publicVar()
   * @return The test results
   */
  int testMe(int a,const char *s);
  /**
   * A pure virtual member.
   * @see testMe()
   * @param c1 the first argument.
   * @param c2 the second argument.
   */
  virtual void testMeToo(char c1,char c2) = 0;
  /**
   * a public variable.
   * Details.
   */
  int publicVar;
  /**
   * a function variable.
   * Details.
   */
  int (*handler)(int a,int b);};
</pre>


</li>
</ul>
</li>
</ul>
</div>

</div>
