src/Software Engineering/Doxygen/Doxygen .org
*** some structural commands are:
#+begin_src sh
•\struct to document a C-struct. 
•\union to document a union. 
•\enum to document an enumeration type. 
•\fn to document a function. 
•\var to document a variable or typedef or enum value. 
•\def to document a #define. 
•\typedef to document a type definition. 
•\file to document a file. 
•\namespace to document a namespace. 
•\package to document a Java package. 
•\interface to document an IDL interface. 
#+end_src

*** Here is an example of a C header named structcmd.h that is documented using structural commands:
#+begin_src c
/*! \file structcmd.h
    \brief A Documented file.
    
    Details.
*/
/*! \def MAX(a,b)
    \brief A macro that returns the maximum of \a a and \a b.
   
    Details.
*/
/*! \var typedef unsigned int UINT32
    \brief A type definition for a .
    
    Details.
*/
/*! \var int errno
    \brief Contains the last error code.
    \warning Not thread safe!
*/
/*! \fn int open(const char *pathname,int flags)
    \brief Opens a file descriptor.
    \param pathname The name of the descriptor.
    \param flags Opening flags.
*/
/*! \fn int close(int fd)
    \brief Closes the file descriptor \a fd.
    \param fd The descriptor to close.
*/
/*! \fn size_t write(int fd,const char *buf, size_t count)
    \brief Writes \a count bytes from \a buf to the filedescriptor \a fd.
    \param fd The descriptor to write to.
    \param buf The data buffer to write.
    \param count The number of bytes to write.
*/
/*! \fn int read(int fd,char *buf,size_t count)
    \brief Read bytes from a file descriptor.
    \param fd The descriptor to read from.
    \param buf The buffer to read into.
    \param count The number of bytes to read.
*/
#define MAX(a,b) (((a)>(b))?(a):(b))
typedef unsigned int UINT32;
int errno;
int open(const char *,int);
int close(int);
size_t write(int,const char *, size_t);
int read(int,char *,size_t);
#+end_src

** Comment blocks in Python
*** For Python there is a standard way of documenting the code using so called documentation strings.
Note that in this case none of doxygen's special commands are supported.
#+begin_src python
  """@package docstring
       Documentation for this module.
       
       More details.
       """
       
       def func():
           """Documentation for a function.
       
          More details.
          """
          pass
      
      class PyClass:
          """Documentation for a class.
      
          More details.
          """
         
          def __init__(self):
              """The constructor."""
              self._memVar = 0;
         
          def PyMethod(self):
              """Documentation for a method."""
             pass
#+end_src

*** using doxygen style comments
There is also another way to document Python code using comments that
start with "##". These type of comment blocks are more in line with
the way documentation blocks work for the other languages supported by
doxygen and this also allows the use of special commands.

#+begin_src python
    ## @package pyexample
    #  Documentation for this module.
    #
    #  More details.
    
    ## Documentation for a function.
    #
    #  More details.
    def func():
       pass
   
   ## Documentation for a class.
   #
   #  More details.
   class PyClass:
      
       ## The constructor.
       def __init__(self):
           self._memVar = 0;
      
       ## Documentation for a method.
       #  @param self The object pointer.
       def PyMethod(self):
           pass
        
       ## A class variable.
       classVar = 0;
   
       ## @var _memVar
       #  a member variable
#+end_src

** Anatomy of a comment block
For this doxygen supports the Markdown syntax, including parts of the Markdown Extra extension.



* 
